[
  {
    "timestamp": 1746867944.169558,
    "type": "run_metadata",
    "text": "Started new session with input: How much Anmol singh paid for his DLF apartment via Capbridge?  at 2025-05-10T09:05:44.169557",
    "tool_name": null,
    "tool_args": null,
    "tool_result": null,
    "final_answer": null,
    "tags": [
      "run_start"
    ],
    "success": null,
    "metadata": {
      "start_time": "2025-05-10T14:35:44.169557",
      "step": 0
    }
  },
  {
    "timestamp": 1746867953.4587433,
    "type": "tool_output",
    "text": "Output of solve_sandbox: {'result': \"FURTHER_PROCESSING_REQUIRED: Found 5 search results:\\n\\n1. ₹50 crore DLF Camellias Gurgaon flat: Here's how Anmol Singh ... - Mint\\n   URL: https://www.livemint.com/companies/rs-50-crore-dlf-camellias-gurgaon-flat-heres-how-anmol-singh-jaggi-used-gensol-funds-11744775479583.html\\n   Summary: On October 06, 2022,Capbridgetransferred ₹ 42.94 crore topurchasetheapartment, the order said, citing information provided byDLF. Theapartmentwas formally allotted to Jasminder Kaur on ...\\n\\n2. How Gensol promoter used company funds to buy ultra-luxury DLF ...\\n   URL: https://www.indiatoday.in/business/story/dlf-camellias-anmol-singh-jaggi-how-did-gensol-promoter-use-company-funds-to-buy-ultra-luxury-home-2709702-2025-04-16\\n   Summary: The market regulator's interim order reveals thatAnmolSinghJaggi, one of Gensol's ...CapbridgeVentures then used Rs 42.94 crore to payDLFtowards thepurchaseof anapartmentin The Camellias project. Sebi said this was a clear case of fund diversion. ... The misuse was not limited to theDLFapartmentpurchase. Sebi said there were ...\\n\\n3. DLF Camellias flat, ₹6 crore to mother: How Gensol's Anmol Singh Jaggi ...\\n   URL: https://www.hindustantimes.com/trending/dlf-camellias-flat-rs-6-crore-to-mother-how-gensol-s-anmol-singh-jaggi-diverted-company-funds-101744768926197.html\\n   Summary: Company funds for personal use. According to the SEBI order,AnmolSinghJaggi and PuneetSinghJaggi diverted company loans for personal use - including thepurchaseof luxury real estate in ...\\n\\n4. DLF Camellias flat for ₹43 cr, ₹6.2 cr to mother: Where Gensol funds ...\\n   URL: https://www.business-standard.com/companies/news/gensol-engineering-fraud-sebi-order-blusmart-anmol-jaggi-puneet-diversion-125041600349_1.html\\n   Summary: ₹42.94 crore of that went into purchasing theDLFCamelliasapartment; ...AnmolSinghJaggi is a shareholder in Third Unicorn Private Limited (holding 2000 shares as of March 31, 2024) ...Capbridgereportedly used ₹42.94 crore of this topurchasethe luxuryapartment. Additional funds were allegedly diverted to unrelated businesses and ...\\n\\n5. How BluSmart promoters diverted EV loans, bought flat in DLF Camellias\\n   URL: https://www.thehansindia.com/business/how-blusmart-promoters-diverted-ev-loans-bought-flat-in-dlf-camellias-963195\\n   Summary: Capbridgethen sent Rs 42.94 crore toDLFfor anapartmentin The Camellias project.DLFconfirmed that the money was used to buy the property in the name of a firm where bothAnmoland Puneet ...\"}",
    "tool_name": "solve_sandbox",
    "tool_args": {
      "plan": "import json\nasync def solve():\n    # PLAN:\n    \"\"\"\n    1. Analyze Query: The user wants to know how much Anmol Singh paid for a DLF apartment through Capbridge.\n    2. Tool Selection: Since the query involves a specific financial transaction, I will first use DuckDuckGo to search for information about Anmol Singh's DLF apartment purchase via Capbridge.\n    3. Output: If the search yields a relevant result, I will return the information as the final answer. If not, I will return FURTHER_PROCESSING_REQUIRED.\n\n    Pattern: Sequential dependency (search, then final answer or further processing)\n    Steps:\n    1. DuckDuckGo search.\n    2. Return final answer or request further processing.\n\n    Error Handling: If the DuckDuckGo search fails, I will proceed with FURTHER_PROCESSING_REQUIRED and not use the cached result, as the search is essential.\n    \"\"\"\n    # FUNCTION_CALL: 1\n    \"\"\"Search DuckDuckGo. Usage: input={\"input\": {\"query\": \"latest AI developments\", \"max_results\": 5} } result = await mcp.call_tool('duckduckgo_search_results', input)\"\"\"\n    input = {\"input\": {\"query\": \"Anmol Singh DLF apartment purchase Capbridge\", \"max_results\": 5}}\n    result = await mcp.call_tool('duckduckgo_search_results', input)\n    search_results = json.loads(result.content[0].text)[\"result\"]\n\n    # Check if search results contain relevant information\n    if search_results:\n        return f\"FURTHER_PROCESSING_REQUIRED: {search_results}\"\n    else:\n        return \"FURTHER_PROCESSING_REQUIRED: No relevant information found in initial search.\""
    },
    "tool_result": {
      "result": "FURTHER_PROCESSING_REQUIRED: Found 5 search results:\n\n1. ₹50 crore DLF Camellias Gurgaon flat: Here's how Anmol Singh ... - Mint\n   URL: https://www.livemint.com/companies/rs-50-crore-dlf-camellias-gurgaon-flat-heres-how-anmol-singh-jaggi-used-gensol-funds-11744775479583.html\n   Summary: On October 06, 2022,Capbridgetransferred ₹ 42.94 crore topurchasetheapartment, the order said, citing information provided byDLF. Theapartmentwas formally allotted to Jasminder Kaur on ...\n\n2. How Gensol promoter used company funds to buy ultra-luxury DLF ...\n   URL: https://www.indiatoday.in/business/story/dlf-camellias-anmol-singh-jaggi-how-did-gensol-promoter-use-company-funds-to-buy-ultra-luxury-home-2709702-2025-04-16\n   Summary: The market regulator's interim order reveals thatAnmolSinghJaggi, one of Gensol's ...CapbridgeVentures then used Rs 42.94 crore to payDLFtowards thepurchaseof anapartmentin The Camellias project. Sebi said this was a clear case of fund diversion. ... The misuse was not limited to theDLFapartmentpurchase. Sebi said there were ...\n\n3. DLF Camellias flat, ₹6 crore to mother: How Gensol's Anmol Singh Jaggi ...\n   URL: https://www.hindustantimes.com/trending/dlf-camellias-flat-rs-6-crore-to-mother-how-gensol-s-anmol-singh-jaggi-diverted-company-funds-101744768926197.html\n   Summary: Company funds for personal use. According to the SEBI order,AnmolSinghJaggi and PuneetSinghJaggi diverted company loans for personal use - including thepurchaseof luxury real estate in ...\n\n4. DLF Camellias flat for ₹43 cr, ₹6.2 cr to mother: Where Gensol funds ...\n   URL: https://www.business-standard.com/companies/news/gensol-engineering-fraud-sebi-order-blusmart-anmol-jaggi-puneet-diversion-125041600349_1.html\n   Summary: ₹42.94 crore of that went into purchasing theDLFCamelliasapartment; ...AnmolSinghJaggi is a shareholder in Third Unicorn Private Limited (holding 2000 shares as of March 31, 2024) ...Capbridgereportedly used ₹42.94 crore of this topurchasethe luxuryapartment. Additional funds were allegedly diverted to unrelated businesses and ...\n\n5. How BluSmart promoters diverted EV loans, bought flat in DLF Camellias\n   URL: https://www.thehansindia.com/business/how-blusmart-promoters-diverted-ev-loans-bought-flat-in-dlf-camellias-963195\n   Summary: Capbridgethen sent Rs 42.94 crore toDLFfor anapartmentin The Camellias project.DLFconfirmed that the money was used to buy the property in the name of a firm where bothAnmoland Puneet ..."
    },
    "final_answer": null,
    "tags": [
      "sandbox"
    ],
    "success": true,
    "metadata": {}
  },
  {
    "timestamp": 1746867972.122101,
    "type": "tool_output",
    "text": "Output of solve_sandbox: {'result': 'FINAL_ANSWER: FURTHER_PROCESSING_REQUIRED: meta=None content=[TextContent(type=\\'text\\', text=\\'programme includes building/ asset communication, feedback sessions with individual tenants and providing feedback to tenants on efficient energy and water consumption. 3. \\\\x07Mechanisms in place to inform consumers of any risk of disruption/ discontinuation of essential services. Any risk of disruption/ discontinuation of essential services is timely communicated to customers occupying the leased properties, through e-mail communication by the FM Teams. 4. \\\\x07Does the entity display product information on the product over and above what is mandated as per local laws? (Y/ N/ Not Applicable). If yes, provide details in brief. Products of DLF include development of residential homes and development, operation and maintenance of commercial office spaces, retail properties (Malls) and hospitality projects (Hotels and Clubs). Product related information is included in the relevant documents provided to the customers at the time of building handover or while entering into a lease agreement, which is as per the local legislation. Content In addition to this, customers are provided with a user handbook which includes information on building features and guidelines for ensuring safe and responsible usage of buildings. Furthermore, majority of its buildings have received LEED certification in ‘Operation and Maintenance’ category or ‘Design and Construction’ category by USGBC. Information related to LEED certifications are displayed in all leased buildings. \\\\x07Did your entity carry out any survey with regard to consumer satisfaction relating to the major products/ services of the entity, significant locations of operation of the entity or the entity as a whole? (Y/ N). Yes, DLF conducts Net Promoter Score (NPS) survey for assessing customer satisfaction and gathering customer feedback. The survey is conducted for both tenants of the leased buildings and customers purchasing the properties, through engaging a third party, covering all major clusters of the real estate portfolio. This helps enhance the understanding of customer perception to continually improve the products and service offerings. 5. \\\\x07Provide the following information relating to data breaches: a. \\\\x07Number of instances of data breaches along-with impact. Nil. b. \\\\x07Percentage of data breaches involving personally identifiable information of customers. Nil. 49 -----\\\\n[Source: DLF_13072023190044_BRSR.pdf, ID: DLF_13072023190044_BRSR_43]\\', annotations=None), TextContent(type=\\'text\\', text=\\'Jaggi and Puneet Singh Jaggi are / were promoter Directors.|Yes| |8.|Gensol Ventures Private Limited|Part of the promoter group of Gensol|Yes| |9.|Gensol EV Lease Private Limited|Subsidiary(Gensol held 88.21% of the company)|Yes| ***Loan for Rs. 71.41 Crore from IREDA (Serial No. 3 in the Table under Para 24)*** ### 31. The disclosure made by Gensol in its annual report for FY 2023, in respect of this loan is given below: **Image:** (g) Indian Renewable Energy Development Agency Limited (IREDA) Rupee term loan of Rs. 1,43,00,000/- carries interest @ 9.95% p.a. The loan is repayable in 20 quarterly installments plus interest thereon and repayment starting from June 1, 2023 of Rs. 1,78,500/- each for first 4 installments, Rs. 3,57,05,000/- each for next “5-12” installment and Rs. 4,96,31,250/- each for “13-20” installment. The above loan is secured against hypothecation of 400 EV cars. **___________________________________________________________________________ ** **Interim Order in the matter of Gensol Engineering Limited Page 9 of 29** ----- ### 32. On September 30, 2022, Gensol received a disbursement of Rs. 71.39 Crore from IREDA in its “ GEL Trust and Retention Account IREDA Limited” (Bank A/c No. 922020025290861) maintained with Axis Bank. On the same day, the Company transferred promoter contribution of Rs. 26.06 Crore from another internal account into the above Trust and Retention Account. The total funds credited in the said account amounted to Rs. 97.46 Crore. 33. On October 03, 2022, Rs. 93.88 Crore was transferred from the Trust and Retention Account to Go-Auto (Bank A/c No. 06792000003065 with HDFC Bank). Prior to this transfer, the balance in the said account of Go-Auto was Rs. 0.79 Crore. It was noted that immediately upon receipt of the said amount, Go- Auto, on the same day, transferred Rs. 50 Crore to Capbridge (Bank A/c No. 920020064107731 with Axis Bank), a disclosed related party of Gensol. The Capbridge account had a balance of Rs. 0.15 Crore prior to this transaction. 34. On October 06, 2022, it was noted that Capbridge transferred Rs. 42.94 Crore to DLF Limited (DLF). As per information provided by DLF (email dated December 17, 2024), the above payment was made towards consideration for the purchase of an apartment in the project The Camellias . The submissions made by DLF Ltd. are summarised below: (a) On September 29, 2022, a sum of Rs. 5 Crore was paid to DLF by Jasminder Kaur, as advance, for booking an apartment in the project The Camellias . (b) On October 06, 2022, Capbridge paid Rs. 42.94 Crore to DLF as part of the consideration for the above apartment booked by Jasminder Kaur. (c) On October 20, 2022, the allotment was formally made to Jasminder Kaur. (d) Thereafter, on request, the allotment was substituted in favour of Capbridge. (e) The advance of Rs. 5 Crore was returned to Jasminder Kaur by DLF on November 21, 2022. 35. A pictorial representation of the above movement of funds is given below: **___________________________________________________________________________ ** **Interim Order in the matter of Gensol Engineering Limited Page 10 of 29** ----- **Image:** GEL TRUST AND RETENTION ACCOUNT IREDALIMITED Rs 93.88 crore 03/10/2022\\\\n[Source: INVG67564.pdf, ID: INVG67564_6]\\', annotations=None), TextContent(type=\\'text\\', text=\"infrastructure facility, DLF had engaged Parsons Brinckerhoff for project management consultancy and construction work had been awarded to IL&FS.[17] Controversies In August 2011, a penalty of ₹6.3 billion (US$74 million) was imposed on DLF by the Competition Commission of India (CCI)[18] after finding DLF guilty of breaching laws regarding the unfair pricing of goods and services. The complaint was lodged against DLF by buyers in its residential projects Belaire & Park Place, located in Gurgaon.[19] In February 2015, the CCI ordered its investigative arm to probe two more projects of DLF in Gurgaon, namely, DLF Regal Gardens[20] and DLF Skycourt.[21][22] DLF land grab case pertains to the alleged illegal acquisition of 50 acres of land in Amipur village, Haryana, back in 2013, during Bhupinder Singh Hooda\\'s tenure as Chief Minister under the Congress government. This matter has led to an investigation by the Central Bureau of Investigation involving Robert Vadra, Bhupinder Singh Hooda, and the DLF, as of around December 2017.[23]\\\\n[Source: dlf.md, ID: dlf_1]\", annotations=None), TextContent(type=\\'text\\', text=\\'The Company promotes responsible development practices through ensuring compliance to all applicable regulatory requirements, incorporating climate resilient building design in its portfolio, promoting the use of renewables for energy generation and procuring sustainable construction material. Any potential environmental impact is identified and assessed at the time of project planning and preventive or mitigative measures are undertaken accordingly. 9. \\\\x07Percentage of value chain partners (by value of business done with such partners) that were assessed for environmental impacts 100% of the critical value chain partners including contractors and vendors engaged in construction of the projects and FM Partners engaged in management of the rental properties are evaluated on environmental parameters. PRINCIPLE 7: Businesses, when engaging in influencing public and regulatory policy, should do so in a manner that is responsible and transparent **Essential Indicators** 1. a. \\\\x07Number of affiliations with trade and industry chambers/ associations. DLF has affiliations with 15 trade and industry chambers/ associations, including national and state level associations. It constantly engages with these trade bodies to advocate sector specific policy reforms and improved transparency and governance. Content ----- b. \\\\x07List the top 10 trade and industry chambers/ associations (determined based on the total members of such body) the entity is a member of/ affiliated to. |S. No.|Name of the trade and industry chambers/ associations|Reach of trade and industry chambers/ associations (State/ National)| |---|---|---| |1|Confederation of Indian Industry (CII)|National| |2|Federation of Indian Chambers of Commerce and Industry (FICCI)|National| |3|The Associated Chambers of Commerce and Industry of India (ASSOCHAM)|National| |4|PHD Chamber of Commerce and Industry (PHDCCI)|National| |5|National Real Estate Development Council (NAREDCO)|National| |6|World Travel & Tourism Council, India Initiative|National| |7|Asia Pacific Real Assets Association (APRAA)|National| |8|CII Delhi|State| |9|The Confederation of Real Estate Developers’ Associations of India (CREDAI) NCR|State| |10|CREDAI Western UP|State| |11|CREDAI Haryana|State| |12|CREDAI Goa|State| |13|CREDAI Chennai|State| |14|NAREDCO Haryana|State| |15|Telangana Real Estate Developers’ Association (TREDA)|State| 2. \\\\x07Provide details of corrective action taken or underway on any issues related to anti- competitive conduct by the entity, based on adverse orders from regulatory authorities. There were no incidents of anti-competitive conduct by DLF during FY 2022-23, hence this is not applicable. |Name of authority|Brief of the case|Corrective action taken| |---|---|---| |Not Applicable||| **Leadership Indicators** 1. \\\\x07Details of public policy positions advocated by the entity: |S.No.|Public policy advocated|Method resorted for such advocacy|Whether information available in public domain? (Y/ N)|Frequency of review by Board (Annually/ Half yearly/ Quarterly/ Others)|Web Link, if available| |---|---|---|---|---|---| |1|Circular from Reserve Bank of India (RBI) on revision of outward remittance limit from USD 1 million to USD 10 million per project towards consultancy for the projects covered under Commercial Real Estate Exposure (CRE).|Through trade chambers|No|-|-| 43 Content ----- DLF ANNUAL REPORT 2022 - 23 Business Responsibility and Sustainability Report |S.No.|Public policy advocated|Method resorted for such advocacy|Whether information available in public domain? (Y/ N)|Frequency of review by Board (Annually/ Half yearly/ Quarterly/ Others)|Web Link, if available| |---|---|---|---|---|---| |2|Applicability of Green Building Incentives or Green Blue Factor as per the Green Ratings for Integrated Habitat Assessment (GRIHA) in the Master Plan of Delhi 2041.|Through trade chambers|No|-|-| |3|Fast Track Clearance of the appeal cases\\\\n[Source: DLF_13072023190044_BRSR.pdf, ID: DLF_13072023190044_BRSR_38]\\', annotations=None), TextContent(type=\\'text\\', text=\\'Maintenance Category from USGBC. LEED Pre-Certification for ‘Platinum’ rating (Core and Shell Development) from USGBC. LEED Zero Water Certification from USGBC. LEED Zero Waste Certification from USGBC for DLF Cybercity - Hyderabad.| |P7|-| |P8|DLF’s Corporate Social Responsibility Policy is in accordance with the provisions of Section 135 of the Companies Act, 2013 and the Rules made thereunder.| |P9|ISO 14001:2015 Environment Management System. ISO 9001 certified Quality Management System. WELL Health-Safety Rating for Facility Operations and Management by International WELL Building Institute. Sword of Honour from the British Safety Council-five-star safety rating system, awarded to DLF’s commercial, retail and hospitality properties.|\\\\n[Source: DLF_13072023190044_BRSR.pdf, ID: DLF_13072023190044_BRSR_10]\\', annotations=None)] isError=False'}",
    "tool_name": "solve_sandbox",
    "tool_args": {
      "plan": "import json\nasync def solve():\n    # PLAN:\n    \"\"\"\n    1. The user is asking about how much Anmol Singh paid for his DLF apartment via Capbridge.\n    2. From the previous turn, we have a search result from Mint about Anmol Singh buying a DLF Camellias Gurgaon flat for ₹50 crore. The URL is https://www.livemint.com/companies/rs-50-crore-dlf-camellias-gu...\n    3. Use convert_webpage_url_into_markdown to extract content from the URL.\n    4. Search extracted content for information about the payment made via Capbridge.\n    5. Return the amount Anmol Singh paid for his DLF apartment via Capbridge.\n\n    Pattern: Sequential dependency\n    Steps: 3\n    Reasoning: The initial search returned a promising article. We will extract content and search it for the answer.\n    Error handling: If the webpage extraction fails, we will use information from the search results.\n    Fallback: If the webpage extraction fails, we will use information from the search results.\n    \"\"\"\n\n    # FUNCTION_CALL: 1\n    \"\"\"Convert a webpage URL into markdown. Usage: input={{\"input\": {{\"url\": \"https://www.livemint.com/companies/rs-50-crore-dlf-camellias-gu...\"}}}} result = await mcp.call_tool('convert_webpage_url_into_markdown', input)\"\"\"\n    input = {\"input\": {\"url\": \"https://www.livemint.com/companies/rs-50-crore-dlf-camellias-gu...\"}}\n    result = await mcp.call_tool('convert_webpage_url_into_markdown', input)\n    content = result.content[0].text\n\n    # FUNCTION_CALL: 2\n    \"\"\"Search documents to get relevant extracts. Usage: input={\"input\": {\"query\": \"Anmol Singh DLF apartment payment via Capbridge\"}} result = await mcp.call_tool('search_stored_documents', input)\"\"\"\n    input = {\"input\": {\"query\": f\"{content} Anmol Singh DLF apartment payment via Capbridge\"}}\n    result = await mcp.call_tool('search_stored_documents', input)\n\n    # FINAL_RESULT\n    return f\"FINAL_ANSWER: FURTHER_PROCESSING_REQUIRED: {result}\""
    },
    "tool_result": {
      "result": "FINAL_ANSWER: FURTHER_PROCESSING_REQUIRED: meta=None content=[TextContent(type='text', text='programme includes building/ asset communication, feedback sessions with individual tenants and providing feedback to tenants on efficient energy and water consumption. 3. \\x07Mechanisms in place to inform consumers of any risk of disruption/ discontinuation of essential services. Any risk of disruption/ discontinuation of essential services is timely communicated to customers occupying the leased properties, through e-mail communication by the FM Teams. 4. \\x07Does the entity display product information on the product over and above what is mandated as per local laws? (Y/ N/ Not Applicable). If yes, provide details in brief. Products of DLF include development of residential homes and development, operation and maintenance of commercial office spaces, retail properties (Malls) and hospitality projects (Hotels and Clubs). Product related information is included in the relevant documents provided to the customers at the time of building handover or while entering into a lease agreement, which is as per the local legislation. Content In addition to this, customers are provided with a user handbook which includes information on building features and guidelines for ensuring safe and responsible usage of buildings. Furthermore, majority of its buildings have received LEED certification in ‘Operation and Maintenance’ category or ‘Design and Construction’ category by USGBC. Information related to LEED certifications are displayed in all leased buildings. \\x07Did your entity carry out any survey with regard to consumer satisfaction relating to the major products/ services of the entity, significant locations of operation of the entity or the entity as a whole? (Y/ N). Yes, DLF conducts Net Promoter Score (NPS) survey for assessing customer satisfaction and gathering customer feedback. The survey is conducted for both tenants of the leased buildings and customers purchasing the properties, through engaging a third party, covering all major clusters of the real estate portfolio. This helps enhance the understanding of customer perception to continually improve the products and service offerings. 5. \\x07Provide the following information relating to data breaches: a. \\x07Number of instances of data breaches along-with impact. Nil. b. \\x07Percentage of data breaches involving personally identifiable information of customers. Nil. 49 -----\\n[Source: DLF_13072023190044_BRSR.pdf, ID: DLF_13072023190044_BRSR_43]', annotations=None), TextContent(type='text', text='Jaggi and Puneet Singh Jaggi are / were promoter Directors.|Yes| |8.|Gensol Ventures Private Limited|Part of the promoter group of Gensol|Yes| |9.|Gensol EV Lease Private Limited|Subsidiary(Gensol held 88.21% of the company)|Yes| ***Loan for Rs. 71.41 Crore from IREDA (Serial No. 3 in the Table under Para 24)*** ### 31. The disclosure made by Gensol in its annual report for FY 2023, in respect of this loan is given below: **Image:** (g) Indian Renewable Energy Development Agency Limited (IREDA) Rupee term loan of Rs. 1,43,00,000/- carries interest @ 9.95% p.a. The loan is repayable in 20 quarterly installments plus interest thereon and repayment starting from June 1, 2023 of Rs. 1,78,500/- each for first 4 installments, Rs. 3,57,05,000/- each for next “5-12” installment and Rs. 4,96,31,250/- each for “13-20” installment. The above loan is secured against hypothecation of 400 EV cars. **___________________________________________________________________________ ** **Interim Order in the matter of Gensol Engineering Limited Page 9 of 29** ----- ### 32. On September 30, 2022, Gensol received a disbursement of Rs. 71.39 Crore from IREDA in its “ GEL Trust and Retention Account IREDA Limited” (Bank A/c No. 922020025290861) maintained with Axis Bank. On the same day, the Company transferred promoter contribution of Rs. 26.06 Crore from another internal account into the above Trust and Retention Account. The total funds credited in the said account amounted to Rs. 97.46 Crore. 33. On October 03, 2022, Rs. 93.88 Crore was transferred from the Trust and Retention Account to Go-Auto (Bank A/c No. 06792000003065 with HDFC Bank). Prior to this transfer, the balance in the said account of Go-Auto was Rs. 0.79 Crore. It was noted that immediately upon receipt of the said amount, Go- Auto, on the same day, transferred Rs. 50 Crore to Capbridge (Bank A/c No. 920020064107731 with Axis Bank), a disclosed related party of Gensol. The Capbridge account had a balance of Rs. 0.15 Crore prior to this transaction. 34. On October 06, 2022, it was noted that Capbridge transferred Rs. 42.94 Crore to DLF Limited (DLF). As per information provided by DLF (email dated December 17, 2024), the above payment was made towards consideration for the purchase of an apartment in the project The Camellias . The submissions made by DLF Ltd. are summarised below: (a) On September 29, 2022, a sum of Rs. 5 Crore was paid to DLF by Jasminder Kaur, as advance, for booking an apartment in the project The Camellias . (b) On October 06, 2022, Capbridge paid Rs. 42.94 Crore to DLF as part of the consideration for the above apartment booked by Jasminder Kaur. (c) On October 20, 2022, the allotment was formally made to Jasminder Kaur. (d) Thereafter, on request, the allotment was substituted in favour of Capbridge. (e) The advance of Rs. 5 Crore was returned to Jasminder Kaur by DLF on November 21, 2022. 35. A pictorial representation of the above movement of funds is given below: **___________________________________________________________________________ ** **Interim Order in the matter of Gensol Engineering Limited Page 10 of 29** ----- **Image:** GEL TRUST AND RETENTION ACCOUNT IREDALIMITED Rs 93.88 crore 03/10/2022\\n[Source: INVG67564.pdf, ID: INVG67564_6]', annotations=None), TextContent(type='text', text=\"infrastructure facility, DLF had engaged Parsons Brinckerhoff for project management consultancy and construction work had been awarded to IL&FS.[17] Controversies In August 2011, a penalty of ₹6.3 billion (US$74 million) was imposed on DLF by the Competition Commission of India (CCI)[18] after finding DLF guilty of breaching laws regarding the unfair pricing of goods and services. The complaint was lodged against DLF by buyers in its residential projects Belaire & Park Place, located in Gurgaon.[19] In February 2015, the CCI ordered its investigative arm to probe two more projects of DLF in Gurgaon, namely, DLF Regal Gardens[20] and DLF Skycourt.[21][22] DLF land grab case pertains to the alleged illegal acquisition of 50 acres of land in Amipur village, Haryana, back in 2013, during Bhupinder Singh Hooda's tenure as Chief Minister under the Congress government. This matter has led to an investigation by the Central Bureau of Investigation involving Robert Vadra, Bhupinder Singh Hooda, and the DLF, as of around December 2017.[23]\\n[Source: dlf.md, ID: dlf_1]\", annotations=None), TextContent(type='text', text='The Company promotes responsible development practices through ensuring compliance to all applicable regulatory requirements, incorporating climate resilient building design in its portfolio, promoting the use of renewables for energy generation and procuring sustainable construction material. Any potential environmental impact is identified and assessed at the time of project planning and preventive or mitigative measures are undertaken accordingly. 9. \\x07Percentage of value chain partners (by value of business done with such partners) that were assessed for environmental impacts 100% of the critical value chain partners including contractors and vendors engaged in construction of the projects and FM Partners engaged in management of the rental properties are evaluated on environmental parameters. PRINCIPLE 7: Businesses, when engaging in influencing public and regulatory policy, should do so in a manner that is responsible and transparent **Essential Indicators** 1. a. \\x07Number of affiliations with trade and industry chambers/ associations. DLF has affiliations with 15 trade and industry chambers/ associations, including national and state level associations. It constantly engages with these trade bodies to advocate sector specific policy reforms and improved transparency and governance. Content ----- b. \\x07List the top 10 trade and industry chambers/ associations (determined based on the total members of such body) the entity is a member of/ affiliated to. |S. No.|Name of the trade and industry chambers/ associations|Reach of trade and industry chambers/ associations (State/ National)| |---|---|---| |1|Confederation of Indian Industry (CII)|National| |2|Federation of Indian Chambers of Commerce and Industry (FICCI)|National| |3|The Associated Chambers of Commerce and Industry of India (ASSOCHAM)|National| |4|PHD Chamber of Commerce and Industry (PHDCCI)|National| |5|National Real Estate Development Council (NAREDCO)|National| |6|World Travel & Tourism Council, India Initiative|National| |7|Asia Pacific Real Assets Association (APRAA)|National| |8|CII Delhi|State| |9|The Confederation of Real Estate Developers’ Associations of India (CREDAI) NCR|State| |10|CREDAI Western UP|State| |11|CREDAI Haryana|State| |12|CREDAI Goa|State| |13|CREDAI Chennai|State| |14|NAREDCO Haryana|State| |15|Telangana Real Estate Developers’ Association (TREDA)|State| 2. \\x07Provide details of corrective action taken or underway on any issues related to anti- competitive conduct by the entity, based on adverse orders from regulatory authorities. There were no incidents of anti-competitive conduct by DLF during FY 2022-23, hence this is not applicable. |Name of authority|Brief of the case|Corrective action taken| |---|---|---| |Not Applicable||| **Leadership Indicators** 1. \\x07Details of public policy positions advocated by the entity: |S.No.|Public policy advocated|Method resorted for such advocacy|Whether information available in public domain? (Y/ N)|Frequency of review by Board (Annually/ Half yearly/ Quarterly/ Others)|Web Link, if available| |---|---|---|---|---|---| |1|Circular from Reserve Bank of India (RBI) on revision of outward remittance limit from USD 1 million to USD 10 million per project towards consultancy for the projects covered under Commercial Real Estate Exposure (CRE).|Through trade chambers|No|-|-| 43 Content ----- DLF ANNUAL REPORT 2022 - 23 Business Responsibility and Sustainability Report |S.No.|Public policy advocated|Method resorted for such advocacy|Whether information available in public domain? (Y/ N)|Frequency of review by Board (Annually/ Half yearly/ Quarterly/ Others)|Web Link, if available| |---|---|---|---|---|---| |2|Applicability of Green Building Incentives or Green Blue Factor as per the Green Ratings for Integrated Habitat Assessment (GRIHA) in the Master Plan of Delhi 2041.|Through trade chambers|No|-|-| |3|Fast Track Clearance of the appeal cases\\n[Source: DLF_13072023190044_BRSR.pdf, ID: DLF_13072023190044_BRSR_38]', annotations=None), TextContent(type='text', text='Maintenance Category from USGBC. LEED Pre-Certification for ‘Platinum’ rating (Core and Shell Development) from USGBC. LEED Zero Water Certification from USGBC. LEED Zero Waste Certification from USGBC for DLF Cybercity - Hyderabad.| |P7|-| |P8|DLF’s Corporate Social Responsibility Policy is in accordance with the provisions of Section 135 of the Companies Act, 2013 and the Rules made thereunder.| |P9|ISO 14001:2015 Environment Management System. ISO 9001 certified Quality Management System. WELL Health-Safety Rating for Facility Operations and Management by International WELL Building Institute. Sword of Honour from the British Safety Council-five-star safety rating system, awarded to DLF’s commercial, retail and hospitality properties.|\\n[Source: DLF_13072023190044_BRSR.pdf, ID: DLF_13072023190044_BRSR_10]', annotations=None)] isError=False"
    },
    "final_answer": null,
    "tags": [
      "sandbox"
    ],
    "success": true,
    "metadata": {}
  }
]